; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v8 ?v10)
             (pred_7 ?v12 ?v6)
             (pred_4 ?v8 ?v6)
             (pred_12 ?v3 ?v8 )
	     (pred_6 ?v8)
             (pred_3 ?v5)
             (pred_9 ?v12)
             (pred_8 ?v6)
             (pred_5 ?v8)
             (pred_11 ?v12)
             (pred_2 ?v8)
             (pred_10 ))



(:action op_2
:parameters (?v9 ?v2 ?v7 ?v11)
:precondition (and (pred_3 ?v9) (pred_3 ?v2) (pred_9 ?v7) (pred_8 ?v11)
          (pred_1 ?v9 ?v2) (pred_7 ?v7 ?v11)
                   (pred_4 ?v2 ?v11) (pred_6 ?v9) 
                   (pred_5 ?v2) (pred_11 ?v7))
:effect (and  (pred_2 ?v2) (not (pred_5 ?v2))))


(:action op_1
:parameters (?v9 ?v13)
:precondition (and (pred_3 ?v9) (pred_3 ?v13)
               (pred_6 ?v9) (pred_1 ?v9 ?v13) (pred_2 ?v13))
:effect (and (pred_6 ?v13) (not (pred_6 ?v9))))

(:action op_3
:parameters (?v9 ?v7)
:precondition (and (pred_3 ?v9) (pred_9 ?v7) 
                  (pred_6 ?v9) (pred_12 ?v7 ?v9) (pred_10 ))
:effect (and (pred_11 ?v7)
   (not (pred_12 ?v7 ?v9)) (not (pred_10 ))))


(:action op_4
:parameters (?v9 ?v4 ?v1)
:precondition (and (pred_3 ?v9) (pred_9 ?v4) (pred_9 ?v1)
                  (pred_6 ?v9) (pred_11 ?v1) (pred_12 ?v4 ?v9))
:effect (and (pred_11 ?v4) (pred_12 ?v1 ?v9)
        (not (pred_11 ?v1)) (not (pred_12 ?v4 ?v9))))

(:action op_5
:parameters (?v9 ?v7)
:precondition (and (pred_3 ?v9) (pred_9 ?v7) 
                  (pred_6 ?v9) (pred_11 ?v7))
:effect (and (pred_10 ) (pred_12 ?v7 ?v9) (not (pred_11 ?v7)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_02 obj_17 obj_22 obj_03 obj_10 obj_09 obj_12 obj_20 obj_01 obj_18 obj_13 obj_15 obj_16 obj_08 obj_19 obj_04
    obj_07 obj_06 obj_21
    obj_11 obj_05 obj_14
    )

    (:init
       (pred_10)

       (pred_3 obj_02)
       (pred_3 obj_17)
       (pred_3 obj_22)
       (pred_3 obj_03)
       (pred_3 obj_10)
       (pred_3 obj_09)
       (pred_3 obj_12)
       (pred_3 obj_20)
       (pred_3 obj_01)
       (pred_3 obj_18)
       (pred_3 obj_13)
       (pred_3 obj_15)
       (pred_3 obj_16)
       (pred_3 obj_08)
       (pred_3 obj_19)
       (pred_3 obj_04)
       (pred_8 obj_07)
       (pred_8 obj_06)
       (pred_8 obj_21)
       (pred_9 obj_11)
       (pred_9 obj_05)
       (pred_9 obj_14)

       (pred_1 obj_02 obj_10)
       (pred_1 obj_02 obj_17)
       (pred_1 obj_17 obj_09)
       (pred_1 obj_17 obj_22)
       (pred_1 obj_17 obj_02)
       (pred_1 obj_22 obj_12)
       (pred_1 obj_22 obj_03)
       (pred_1 obj_22 obj_17)
       (pred_1 obj_03 obj_20)
       (pred_1 obj_03 obj_22)
       (pred_1 obj_10 obj_01)
       (pred_1 obj_10 obj_09)
       (pred_1 obj_10 obj_02)
       (pred_1 obj_09 obj_18)
       (pred_1 obj_09 obj_12)
       (pred_1 obj_09 obj_17)
       (pred_1 obj_09 obj_10)
       (pred_1 obj_12 obj_13)
       (pred_1 obj_12 obj_20)
       (pred_1 obj_12 obj_22)
       (pred_1 obj_12 obj_09)
       (pred_1 obj_20 obj_15)
       (pred_1 obj_20 obj_03)
       (pred_1 obj_20 obj_12)
       (pred_1 obj_01 obj_16)
       (pred_1 obj_01 obj_18)
       (pred_1 obj_01 obj_10)
       (pred_1 obj_18 obj_08)
       (pred_1 obj_18 obj_13)
       (pred_1 obj_18 obj_09)
       (pred_1 obj_18 obj_01)
       (pred_1 obj_13 obj_19)
       (pred_1 obj_13 obj_15)
       (pred_1 obj_13 obj_12)
       (pred_1 obj_13 obj_18)
       (pred_1 obj_15 obj_04)
       (pred_1 obj_15 obj_20)
       (pred_1 obj_15 obj_13)
       (pred_1 obj_16 obj_08)
       (pred_1 obj_16 obj_01)
       (pred_1 obj_08 obj_19)
       (pred_1 obj_08 obj_18)
       (pred_1 obj_08 obj_16)
       (pred_1 obj_19 obj_04)
       (pred_1 obj_19 obj_13)
       (pred_1 obj_19 obj_08)
       (pred_1 obj_04 obj_15)
       (pred_1 obj_04 obj_19)
       (pred_5 obj_02)
       (pred_5 obj_15)
       (pred_5 obj_20)
       (pred_4  obj_02 obj_07)
       (pred_4  obj_15 obj_06)
       (pred_4  obj_20 obj_21)
       (pred_2 obj_17)
       (pred_2 obj_22)
       (pred_2 obj_03)
       (pred_2 obj_10)
       (pred_2 obj_09)
       (pred_2 obj_12)
       (pred_2 obj_01)
       (pred_2 obj_18)
       (pred_2 obj_13)
       (pred_2 obj_16)
       (pred_2 obj_08)
       (pred_2 obj_19)
       (pred_2 obj_04)

       (pred_7  obj_11 obj_07)
       (pred_7  obj_05 obj_06)
       (pred_7  obj_14 obj_21)
       (pred_12 obj_11 obj_12)
       (pred_12 obj_05 obj_04)
       (pred_12 obj_14 obj_19)
       (pred_6 obj_10)
    )

    (:goal (and
       (pred_12 obj_05 obj_19)
       (pred_12 obj_14 obj_04)
    ))
(:constraints
  (always (not (pred_6 obj_13)))
)
)

; plan
1. (op_1 obj_10 obj_09)
   deleted: (pred_6 obj_10)
   added: (pred_6 obj_09)
   goals met: 0 of 2
2. (op_1 obj_09 obj_12)
   deleted: (pred_6 obj_09)
   added: (pred_6 obj_12)
   goals met: 0 of 2
3. (op_3 obj_12 obj_11)
   deleted: (pred_12 obj_11 obj_12) (pred_10)
   added: (pred_11 obj_11)
   goals met: 0 of 2
4. (op_1 obj_12 obj_09)
   deleted: (pred_6 obj_12)
   added: (pred_6 obj_09)
   goals met: 0 of 2
5. (op_1 obj_09 obj_18)
   deleted: (pred_6 obj_09)
   added: (pred_6 obj_18)
   goals met: 0 of 2
6. (op_1 obj_18 obj_08)
   deleted: (pred_6 obj_18)
   added: (pred_6 obj_08)
   goals met: 0 of 2
7. (op_1 obj_08 obj_19)
   deleted: (pred_6 obj_08)
   added: (pred_6 obj_19)
   goals met: 0 of 2
8. (op_4 obj_19 obj_14 obj_11)
   deleted: (pred_11 obj_11) (pred_12 obj_14 obj_19)
   added: (pred_11 obj_14) (pred_12 obj_11 obj_19)
   goals met: 0 of 2
9. (op_1 obj_19 obj_04)
   deleted: (pred_6 obj_19)
   added: (pred_6 obj_04)
   goals met: 0 of 2
10. (op_4 obj_04 obj_05 obj_14)
   deleted: (pred_11 obj_14) (pred_12 obj_05 obj_04)
   added: (pred_11 obj_05) (pred_12 obj_14 obj_04)
   goals met: 1 of 2
11. (op_1 obj_04 obj_19)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_19)
   goals met: 1 of 2
12. (op_4 obj_19 obj_11 obj_05)
   deleted: (pred_11 obj_05) (pred_12 obj_11 obj_19)
   added: (pred_11 obj_11) (pred_12 obj_05 obj_19)
   goals met: 2 of 2
